## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # argocd_application.keda will be destroyed
  # (because argocd_application.keda is not in configuration)
-   resource "argocd_application" "keda" {
-       cascade = true -> null
-       id      = "keda" -> null
-       wait    = true -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 563 -> null
-           labels           = {
-               "env" = "dev"
            } -> null
-           name             = "keda" -> null
-           namespace        = "argocd" -> null
-           resource_version = "4605641" -> null
-           uid              = "ae223024-53e7-4700-834c-da8b3f62ee21" -> null
        }

-       spec {
-           project                = "cinema" -> null
-           revision_history_limit = 10 -> null

-           destination {
-               namespace = "cinema" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }

-           source {
-               chart           = "keda" -> null
-               path            = "." -> null
-               repo_url        = "https://kedacore.github.io/charts" -> null
-               target_revision = "2.8.2" -> null

-               helm {
-                   release_name = "keda" -> null
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                }
            }
        }
    }

  # argocd_application.keda-cinema will be created
+   resource "argocd_application" "keda-cinema" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cinema"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               chart           = "keda"
+               path            = "."
+               repo_url        = "https://kedacore.github.io/charts"
+               target_revision = "2.8.2"

+               helm {
+                   release_name = "keda"
                }
            }
        }
    }

  # argocd_application.keda-loadtesting will be created
+   resource "argocd_application" "keda-loadtesting" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-loadtesting"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "loadtesting"
+           revision_history_limit = 10

+           destination {
+               namespace = "loadtesting"
+               server    = "https://82282b3b-3063-4462-92c5-160718170247.k8s.ondigitalocean.com"
            }

+           source {
+               chart           = "keda"
+               path            = "."
+               repo_url        = "https://kedacore.github.io/charts"
+               target_revision = "2.8.2"

+               helm {
+                   release_name = "keda"
                }
            }
        }
    }

  # argocd_application.keda-scaledobject will be destroyed
  # (because argocd_application.keda-scaledobject is not in configuration)
-   resource "argocd_application" "keda-scaledobject" {
-       cascade = true -> null
-       id      = "keda-cron" -> null
-       wait    = true -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 37 -> null
-           labels           = {
-               "env" = "dev"
            } -> null
-           name             = "keda-cron" -> null
-           namespace        = "argocd" -> null
-           resource_version = "4605637" -> null
-           uid              = "a74524cd-9148-49b3-b55d-d6316c20db4c" -> null
        }

-       spec {
-           project                = "cinema" -> null
-           revision_history_limit = 10 -> null

-           destination {
-               namespace = "cinema" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }

-           source {
-               path            = "charts/keda" -> null
-               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf" -> null
-               target_revision = "main" -> null

-               helm {
-                   release_name = "keda-cron" -> null
-                   skip_crds    = false -> null
-                   value_files  = [] -> null

-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.name" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.namespace" -> null
-                       value        = "cinema" -> null
                    }
-                   parameter {
-                       force_string = false -> null
-                       name         = "keda.scaletargetname" -> null
-                       value        = "cinema" -> null
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema will be created
+   resource "argocd_application" "keda-scaledobject-cinema" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cron"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema"
                    }
                }
            }
        }
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-4pzgj" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
